; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	thermograph3 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	GroundStation8 - direction
	Star0 - direction
	Star12 - direction
	Star3 - direction
	Star11 - direction
	GroundStation7 - direction
	Star14 - direction
	GroundStation9 - direction
	Star4 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation13 - direction
	Star10 - direction
	GroundStation6 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon18)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star12)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star10)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star14)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 spectrograph2)
	(supports instrument6 thermograph3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet19)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet17)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star1)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation13)
	(supports instrument9 spectrograph2)
	(supports instrument9 thermograph3)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 Star10)
	(calibration_target instrument9 GroundStation13)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite1 GroundStation9)
	(pointing satellite2 Star21)
	(pointing satellite3 Star10)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 thermograph1)
	(have_image Planet17 thermograph1)
	(have_image Phenomenon18 spectrograph2)
	(have_image Planet19 spectrograph2)
	(have_image Planet20 spectrograph0)
	(have_image Star21 spectrograph2)
))

)

; plan
1. (turn_to satellite2 star21 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 star21)
   goals met: 2 of 10
2. (turn_to satellite1 groundstation6 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 groundstation6)
   goals met: 2 of 10
3. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 2 of 10
4. (calibrate satellite1 instrument6 groundstation6)
   added: (calibrated instrument6)
   goals met: 2 of 10
5. (turn_to satellite1 planet19 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet19)
   goals met: 2 of 10
6. (take_image satellite1 planet19 instrument6 spectrograph2)
   added: (have_image planet19 spectrograph2)
   goals met: 3 of 10
7. (turn_to satellite1 phenomenon18 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 phenomenon18)
   goals met: 3 of 10
8. (turn_to satellite0 groundstation5 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 groundstation5)
   goals met: 3 of 10
9. (take_image satellite1 phenomenon18 instrument6 spectrograph2)
   added: (have_image phenomenon18 spectrograph2)
   goals met: 4 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
11. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon15 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon15 instrument0 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 5 of 10
14. (turn_to satellite0 planet17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet17)
   goals met: 5 of 10
15. (take_image satellite0 planet17 instrument0 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 6 of 10
16. (turn_to satellite0 star16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star16)
   goals met: 6 of 10
17. (take_image satellite0 star16 instrument0 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 7 of 10
18. (turn_to satellite1 planet20 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 planet20)
   goals met: 7 of 10
19. (take_image satellite1 planet20 instrument6 spectrograph0)
   added: (have_image planet20 spectrograph0)
   goals met: 8 of 10
20. (turn_to satellite1 star21 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 star21)
   goals met: 8 of 10
21. (take_image satellite1 star21 instrument6 spectrograph2)
   added: (have_image star21 spectrograph2)
   goals met: 9 of 10
22. (turn_to satellite1 groundstation9 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 groundstation9)
   goals met: 10 of 10
